/**
 *  位运算：
 *      - 嵌入式主要的操作
 *      - 位与： & 都是1则返回1否则返回0
 *      - 位或： | 有1则1
 *      - 异或： ^ 相同为0不同为1
 *      - 左移： << 相当于是乘以2
 *      - 右移： >> 相当于是除以2
 *      - 取反： ~ 1变0 0变1
 */
#include <stdio.h>

int main() {
    int a = 0b0101; // 5
    int b = 0b1001; // 9

    printf("%d\n", a & b); // 0b0001 1
    printf("%d\n", a | b); // 0b1101 13
    printf("%d\n", a ^ b); // 0b1100 12

    /**
     *  32位控制引脚输出高低电平的寄存器
     *      0 表示低电平
     *      1 表示高电平
     * 
     *  GPIOA组引脚PA0-PA15
     *  需要设置第5个引脚位高电平
     *  0b 00000000 00000000 00000000 0001 0000
     *  0x 00 00 00 10
     * 
    */
    // 需要设置第5个引脚位高电平
    int c = 0x44444400;
    printf("0x%x\n", c | 1<<4); // 0x44444410
    int d = 0xffffffff;
    // int d = 0xffffffef;
    // 当前：0b1111111111111111111111111111111
    // 位与：0b1111111111111111111111111101111  (~0x10)
    // 取反：0b0000000000000000000000000010000 （0x10）
    // 结果：0b1111111111111111111111111101111
    // 第5个引脚设置为低电平
    // 0x10 = 1 << 4
    printf("0x%x\n", d & ~0x10);
    printf("0x%x\n", d & ~(1<<4));
    printf("0x%x\n", d & 0b11111111111111111111111111101111);
    return 0;
}