/**
 *  打印9行9列的正方形
 * 
 *  printf("*") ----- 表示点
 *  printf("*")
 *  printf("*")
 *  printf("*")
 *  printf("*") ----- 表示线
 * 
 *  - 线+换行符 ----- 平面 
 *  
 * 循环嵌套：
 *      - 内层循环控制的列
 *      - 外层循环控制的行
 */
#include <stdio.h>

int main()
{
    // 清空终端屏幕、重置光标位置、设置文字颜色为绿色
    printf("\033[2J\033[0;0H\033[32m");
    // 外层循环（控制行的数量）
    // 面
    for (int i = 0; i < 19; i++)
    {
        // 内层循环（控制列的数量）
        // 线
        for (int i = 0; i < 19; i++)
        {
            printf(" * "); // 点
        }
        printf("\n");
    }

    // 重置所有样式属性
    printf("\033[0m");
    return 0;
}